app/controllers/admin/items_controller.rb

INSERT INTO "items" ("title", "description", "price", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
        def create

            @item = Item.create(
                'title' => params[:title],
                'description' => params[:description],
                'price' => params[:price],
                'image_url' => params[:image_url],
                'category_id' => params[:category_id]
            )

            if @item.save