app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" LIMIT $1  [["LIMIT", 1]]
---
        def index
            @orders = Order.all