app/views/admin/orders/index.html.erb

                <td><%= order.user.email%></td>
                <td><%= order.user.first_name%></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]