app/views/admin/orders/show.html.erb

                <td><%= @order.created_at%></td>
                <td><%= @order.user.first_name%></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]