app/controllers/cart_controller.rb

INSERT INTO "join_table_cart_items" ("created_at", "updated_at", "cart_id", "item_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-15 20:32:51.485145"], ["updated_at", "2022-03-15 20:32:51.485145"], ["cart_id", 11], ["item_id", 1]]
---
    def create
    @cart = JoinTableCartItem.new(cart_params)

    if @cart.save

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
---
  def show
    @cart = JoinTableCartItem.find(Cart.find_by(user_id: params[:id]).id)