app/controllers/cart_controller.rb

  def updatecart
    @cart = Cart.find(params[:id])
    @article = @cart.join_table_cart_items

    @article.each do |item|
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]

  def total
    @cart = Cart.find_by(user_id: current_user.id)
    @total = 0
    @cart.join_table_cart_items.each do |item|
      @total = @total + (item.item.price * item.quantity)
    end

    @cart.update(total: @total)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]
UPDATE "carts" SET "total" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["total", "19.99"], ["updated_at", "2022-03-16 11:47:46.995271"], ["id", 16]]