app/controllers/charges_controller.rb

    def create
      # Amount in cents
      @amount = 500
      @cart = Cart.find_by(user_id: current_user.id)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]