app/controllers/jointablecartitem_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
INSERT INTO "join_table_cart_items" ("created_at", "updated_at", "cart_id", "item_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-16 08:31:21.026900"], ["updated_at", "2022-03-16 08:31:21.026900"], ["cart_id", 16], ["item_id", 1]]
---
    def create
    @cartitem = JoinTableCartItem.new(
      'item_id' => params[:item_id],
      'quantity' => params[:quantity],
      'cart_id' => Cart.find_by(user_id: current_user.id).id
    )

    total()

    if @cartitem.save
      flash[:notice] = "Item Add"
    else
      flash[:notice] = "please try again"
    end

    respond_to do |format|
        format.html { redirect_to cart_path(Cart.find_by(user_id: current_user.id).id) }

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @cartitem = JoinTableCartItem.find(params[:id])

SELECT  "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "join_table_cart_items" WHERE "join_table_cart_items"."id" = $1  [["id", 6]]
---
  def destroy
    @cart = JoinTableCartItem.find(params[:id])
    @cart.destroy

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]
UPDATE "carts" SET "total" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["total", "0.0"], ["updated_at", "2022-03-16 19:57:52.152700"], ["id", 16]]
---
  def total
    @cart = Cart.find_by(user_id: current_user.id)
    @total = 0
    @cart.join_table_cart_items.each do |item|
      @total = @total + (item.item.price * item.quantity)
    end

    @cart.update(total: @total)