app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @orders = Order.all

INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-03-16 11:48:06.527738"], ["updated_at", "2022-03-16 11:48:06.527738"], ["user_id", 11]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."id" DESC LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
---
  def create
    order = Order.new(
      'user_id' => current_user.id
    )

    order.save
    @order = Order.where(user_id: current_user.id).last

SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]
INSERT INTO "join_table_item_orders" ("created_at", "updated_at", "item_id", "order_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-16 11:48:06.572548"], ["updated_at", "2022-03-16 11:48:06.572548"], ["item_id", 1], ["order_id", 6]]
---
  def joinitem
    @cart = Cart.find_by(user_id: current_user.id)

    @cart.join_table_cart_items.each do |item|
       article = JoinTableItemOrder.new(
        'item_id' => item.item_id,
        'quantity' => item.quantity,
        'order_id' => @order.id
      )
      if article.save

SELECT "join_table_item_orders".* FROM "join_table_item_orders" WHERE "join_table_item_orders"."order_id" = $1  [["order_id", 6]]
---
  def total
    @total = 0
    @order.join_table_item_orders.each do |item|