app/controllers/orders_controller.rb

  def create

    @cart = current_user.cart

    @total = @cart.total
    @amount = (@total * 100).to_i

    customer = Stripe::Customer.create({
      email: params[:stripeEmail],
      source: params[:stripeToken],
    })

    charge = Stripe::Charge.create({
      customer: customer.id,
      amount: @amount,
#      description: 'Rails Stripe customer',
      currency: 'eur',
    })

  rescue Stripe::CardError => e
    flash[:error] = e.message
    redirect_to new_charge_path
  else

    order = Order.new(
      'user_id' => current_user.id
    )

    order.save
    @order = Order.where(user_id: current_user.id).last
---
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-03-16 20:45:52.258488"], ["updated_at", "2022-03-16 20:45:52.258488"], ["user_id", 11]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."id" DESC LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]

  def update
    @order = Order.find(params[:id])
    @order.update(post_params)
---
UPDATE "orders" SET "total" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total", "39.98"], ["updated_at", "2022-03-16 11:48:06.616070"], ["id", 6]]

  def destroy
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def joinitem
    @cart = Cart.find_by(user_id: current_user.id)

    @cart.join_table_cart_items.each do |item|
       article = JoinTableItemOrder.new(
        'item_id' => item.item_id,
        'quantity' => item.quantity,
        'order_id' => @order.id
      )
      if article.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]
INSERT INTO "join_table_item_orders" ("created_at", "updated_at", "item_id", "order_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-16 20:55:10.724058"], ["updated_at", "2022-03-16 20:55:10.724058"], ["item_id", 1], ["order_id", 15]]

  def total
    @total = 0
    @order.join_table_item_orders.each do |item|
      @total = @total + (item.item.price * item.quantity)
    end

    @order.update(total: @total)
---
SELECT "join_table_item_orders".* FROM "join_table_item_orders" WHERE "join_table_item_orders"."order_id" = $1  [["order_id", 15]]
UPDATE "orders" SET "total" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total", "19.99"], ["updated_at", "2022-03-16 20:55:10.739784"], ["id", 15]]

  def updatecart
    @cart = Cart.find_by(user_id: current_user.id)
    @article = @cart.join_table_cart_items

    @article.each do |item|
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]

  def updatetotal
    @cart = current_user.cart
    @cart.update(total: 0)
---
UPDATE "carts" SET "total" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["total", "0.0"], ["updated_at", "2022-03-16 20:57:24.735360"], ["id", 16]]