app/models/user.rb

  def cartcreate
    Cart.create(user_id: self.id)
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-03-16 08:12:12.459998"], ["updated_at", "2022-03-16 08:12:12.459998"], ["user_id", 1]]