app/views/charges/create.html.erb

SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]
---
                  <h5>Items ordered:</h5>
                  <% @cart.join_table_cart_items.each do |item|%>